{
  "title": "Deep Learning–Assisted Gait Parameter Assessment for Neurodegenerative Diseases: Model Development and Validation\nDeep Learning–Assisted Gait Parameter Assessment for Neurodegenerative Diseases",
  "short_title": "Deep Learning–Assisted Gait Parameter Assessment for Neurodegenerative Diseases: Model Development and Validation\nDeep Learning–Assisted Gait Parameter Assessment for Neurodegenerative Diseases",
  "author": "Yu Jing*, __<u>Peinuan Qin</u>__* , Xiangmin Fan, Wei Qiang, Zhu Wencheng, Wei Sun, Feng Tian, Dakuo Wang",
  "abstract": "Neurodegenerative diseases (NDDs) are prevalent among older adults worldwide. Early diagnosis of NDD is challenging yet crucial. Gait status has been identified as an indicator of early-stage NDD changes and can play a significant role in diagnosis, treatment, and rehabilitation. Historically, gait assessment has relied on intricate but imprecise scales by trained professionals or required patients to wear additional equipment, causing discomfort. Advancements in artificial intelligence may completely transform this and offer a novel approach to gait evaluation.\nThis study aimed to use cutting-edge machine learning techniques to offer patients a noninvasive, entirely contactless gait assessment and provide health care professionals with precise gait assessment results covering all common gait-related parameters to assist in diagnosis and rehabilitation planning.\nData collection involved motion data from 41 different participants aged 25 to 85 (mean 57.51, SD 12.93) years captured in motion sequences using the Azure Kinect (Microsoft Corp; a 3D camera with a 30-Hz sampling frequency). Support vector machine (SVM) and bidirectional long short-term memory (Bi-LSTM) classifiers trained using spatiotemporal features extracted from raw data were used to identify gait types in each walking frame. Gait semantics could then be obtained from the frame labels, and all the gait parameters could be calculated accordingly. For optimal generalization performance of the model, the classifiers were trained using a 10-fold cross-validation strategy. The proposed algorithm was also compared with the previous best heuristic method. Qualitative and quantitative feedback from medical staff and patients in actual medical scenarios was extensively collected for usability analysis.\nThe evaluations comprised 3 aspects. Regarding the classification results from the 2 classifiers, Bi-LSTM achieved an average precision, recall, and F1-score of 90.54%, 90.41%, and 90.38%, respectively, whereas these metrics were 86.99%, 86.62%, and 86.67%, respectively, for SVM. Moreover, the Bi-LSTM–based method attained 93.2% accuracy in gait segmentation evaluation (tolerance set to 2), whereas that of the SVM-based method achieved only 77.5% accuracy. For the final gait parameter calculation result, the average error rate of the heuristic method, SVM, and Bi-LSTM was 20.91% (SD 24.69%), 5.85% (SD 5.45%), and 3.17% (SD 2.75%), respectively.\nThis study demonstrated that the Bi-LSTM–based approach can effectively support accurate gait parameter assessment, assisting medical professionals in making early diagnoses and reasonable rehabilitation plans for patients with NDD.\n",
  "url": "https://www.jmir.org/2023/1/e46427/",
  "labels": [],
  "status": ["🟢 Accept"],
  "published": "JMIR2023",
  "year": "2025-2028",
  "image": "/projects/Gait/img.png"
}
